Revit 2026 API

# ImageExportOptionsSetViewsAndSheets Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetViewsAndSheets(
	IList<ElementId> viewsAndSheets
)
```
```vb
Public Sub SetViewsAndSheets (
	viewsAndSheets As IList(Of ElementId)
)
```
```cpp
public:
void SetViewsAndSheets(
	IList<ElementId^>^ viewsAndSheets
)
```
```fsharp
member SetViewsAndSheets :
        viewsAndSheets : IList<ElementId> -> unit
```

#### Parameters

viewsAndSheets IListElementId

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace